Revit 2027 API
ApplicationEntryPoint.GetRibbonPanels Method
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override List<RibbonPanel> GetRibbonPanels()
Public Overrides Function GetRibbonPanels As List(Of RibbonPanel)
public:
virtual List<RibbonPanel^>^ GetRibbonPanels() override
abstract GetRibbonPanels : unit -> List<RibbonPanel>
override GetRibbonPanels : unit -> List<RibbonPanel>
Return Value
List<RibbonPanel>
See Also
Reference
ApplicationEntryPoint Class
GetRibbonPanels Overload
Autodesk.Revit.UI.Macros Namespace